package com.syntax;

public class Basic {

	/**
	 * 核心概念：java程序可以看作为一类对象的集合，这些对象通过调用彼此的方法来协同工作
	 * 
	 * 对象：对象是类的一个实例，有状态和行为
	 * 
	 * 类：是类的一个模板，描述一类对象的行为和状态
	 * 
	 * 方法：就是行为，这个类可以做什么事情，可以有很多方法
	 * 
	 * 实例变量： 每个对象拥有的资源，在创建的时候分配。通过这些方法显现出来
	 * 
	 */
	
	public static void main(String[] args){
		
	}
	
	/**
	 * 打印Hello World
	 * 
	 */
	public static void method1(){
		System.out.println("Hello World");
	}
	
	/**
	 * 每个方法应该拥有的参数
	 * @author
	 * @version
	 * @param
	 * @return
	 */
	
	/**
	 * Java的基本语法：
	 * 1. 大小写敏感：对于标识符（变量 函数名）是大小写敏感的
	 * 2. 命名方式：
	 * 		类名： 一个单词，首字母大写。多个单词，每个单词的首字母大写
	 * 		方法名：一个单词，全小写。多个单词：第一个单词小写，后面的单词首字母大写
	 * 		变量名：以小写为主，final之后的变量全部大写
	 * 
	 * 3. 主方法：
	 * 		所有java程序的入口，虚拟机识别后从这开始执行
	 * 		public static void main(String[] args){
	 * 		}
	 * 
	 * 4. 标识符：
	 * 		可以用的符号：大小写字母，美元$，下划线_ 开始 只有这三种符号可以使用
	 * 		关键字不能作为标识符
	 * 		大小写敏感
	 * 
	 * 5. 修饰符：
	 * 		作用：修饰类中的方法和属性，分类标准：是否控制访问
	 * 		类型： 访问控制修饰符：public private protect private
	 * 			  非访问控制修饰符：final abstract strictfp
	 * 
	 * 6. 标量类型：
	 * 		全局变量：放在类中
	 * 		静态变量
	 * 		成员变量
	 * 
	 * 7. 数组：
	 * 		本质：存储在堆上的对象，可以保存多个变量类型。重点是多个！
	 * 
	 * 8. 枚举：限制变量使用，只能是预设好的变量值。可以减少bug
	 * 		可以单独申明在类里。
	 * 
	 * 9.继承
	 * 
	 * 10. 接口
	 * 
	 */
	
	
}
